#include <cs50.h>
#include <stdio.h>

int main(void)
  
{ 
    
    char c = get_char("Висота: ");

 
    {
    if (c == '0' || c == '0')
        printf("Спробуй ще від 1 до 8\n");
        
        {
            if (c>'8' || c > '8') 
            printf("Спробуй ще від 1 до 8\n");
        {
            if (c<'1' || c == '0') 
            printf("Спробуй ще від 1 до 8\n");
            
        }
            
               
        }
    }
    if (c == '1' || c == '1')
    {
        printf(".......#\n");
    }
    else if (c == '2' || c == '2')
    {
        printf(".......#\n......##\n");
    }
    if (c == '3' || c == '3')
    {
        printf(".......#\n......##\n.....###\n");
    }
    else if (c == '4' || c == '4')
    {
        printf(".......#\n......##\n.....###\n....####\n");
    }
    if (c == '5' || c == '5')
    {
        printf(".......#\n......##\n.....###\n....####\n...#####\n");
    }
    else if (c == '6' || c == '6')
    {
        printf(".......#\n......##\n.....###\n....####\n...#####\n..######\n");
    }
    if (c == '7' || c == '7')
    {
        printf(".......#\n......##\n.....###\n....####\n...#####\n..######\n.#######\n");
    }
    else if (c == '8' || c == '8')
    {
        printf(".......#\n......##\n.....###\n....####\n...#####\n..######\n.#######\n########\n");
    }
    
}

 
  
